###Boolean1◦. Дано целое число A.
###Проверить истинность высказывания: «Число A является положительным
##a=int(input())
##L= a > 0
##print(L)
###Boolean2◦. Дано целое число A.
###Проверить истинность высказывания: «Число A является нечетным
##a=int(input())
##O= a%2 !=0
##print(O)
###Boolean3◦. Дано целое число A.
###Проверить истинность высказывания: «Число A является четным
##a=int(input())
##K= a%2 == 0
##print(K)
###Boolean4◦. Даны два целых числа: A, B. Проверить истинность высказывания:
###«Справедливы неравенства A > 2 и B ≤ 3
##print("Введите целое число")
##a= int(input())
##print("Введите целое число")
##b= int(input())
##L = a > 2 and b <= 3
##print(L)
###Boolean5◦. Даны два целых числа: A, B. Проверить истинность высказывания:
###«Справедливы неравенства A ≥ 0 или B < −2
###Boolean6◦
###. Даны три целых числа: A, B, C.
###Проверить истинность высказывания:
###«Справедливо двойное неравенство A < B < C»
##print("Введите целое число")
##a=int(input())
##print("Введите целое число")
##b=int(input())
##print("Введите целое число")
##c=int(input())
##G= a<b<c
##print(G)
###Boolean7◦. Даны три целых числа:
###A, B, C. Проверить истинность высказывания:
###«Число B находится между числами A и C
##print("Введите целое число")
##a=int(input())
##print("Введите целое число")
##b=int(input())
##print("Введите целое число")
##c=int(input())
##L= a < b < c or c<b<a
##print(L)
###Boolean8◦. Даны два целых числа: A, B. Проверить истинность высказывания:
###«Каждое из чисел A и B нечетное
##print("Введите целое число")
##a=int(input())
##print("Введите целое число")
##b=int(input())
##l= a%2 != 0 and b%2 != 0
##print(l)
###Boolean9◦. Даны два целых числа: A, B. Проверить истинность высказывания:
###«Хотя бы одно из чисел A и B нечетное»
##print("Введите целое число")
##a=int(input())
##print("Введите целое число")
##b=int(input())
##N= a%2 != 0 or b%2 != 0
##print(N)
###Boolean10◦. Даны два целых числа: A, B. Проверить истинность высказывания:
###«Ровно одно из чисел A и B нечетное
##print("Введите целое число")
##a= int(input())
##print("Введите целое число")
##b=int(input())
##M= (a%2 != 0 and b%2 == 0)  or (a%2 == 0 and b%2 !=0)
##print(M)
###Boolean11◦. Даны два целых числа: A, B. Проверить истинность высказывания:
###«Числа A и B имеют одинаковую четность
##a= int(input())
##b=int(input())
##C = (a %2 == 0 and b %2 == 0) or (a%2 != 0 and b%2 != 0)
##print(C)
###Boolean12◦. Даны три целых числа: A, B, C. Проверить истинность высказывания:
###«Каждое из чисел A, B, C положительное»
##a=int(input())
##b=int(input())
##c=int(input())
##N= a > 0 and b> 0 and c > 0
##print(N)
###Boolean13◦. Даны три целых числа: A, B, C. Проверить истинность высказывания:
###«Хотя бы одно из чисел A, B, C положительное
##a=int(input())
##b=int(input())
##c=int(input())
##B= a > 0 or b > 0 or c > 0
##print(B)
###Boolean14◦. Даны три целых числа: A, B, C.
###Проверить истинность высказывания: «Ровно одно из чисел A, B, C положительное»
##a=int(input())
##b=int(input())
##c=int(input())
##B= a > 0 and b > 0 and c > 0 or a < 0 and b > 0 and c> 0 or a> 0 and b< 0 and c> 0 or a> 0 and b>0 and c<0
##print(B)
###Boolean15◦. Даны три целых числа: A, B, C. Проверить истинность высказывания:
###«Ровно два из чисел A, B, C являются положительными
##a=int(input())
##b=int(input())
##c=int(input())
##N= a>0 and b> 0 and c< 0 or a<0 and b> 0 and c>0



























